%% Task 1
clear, close, clc
g = 4; % Згідно списку
k = 5; % Kachaikin is fifth in list of gr
d = 173; % Birthday - 22 June, 173 day of Year
A = [0.3+g*1e-2,       0.10,       0.04, 0.02;...
			  0.20, 0.5-k*1e-3,       0.05, 0.12;...        
           0.03,       0.01, 0.5-d*1e-4, 0.10;...
           0.12,       0.05,       0.30, 0.55];
Y = [200;100;300;150];
n = length(Y);
E = eye(n);
% Пункт 1. Матриця повних затрат:
disp("Пункт 1. Матриця повних затрат:")
% (a) За допомогою inv(*):
B1 = inv(E-A);
disp("Результат за допомогою прямого методу Inv")
disp(B1)
% (b) За допомогою обчислення суми матричного ряду
disp("Результат за допомогою обчислення суми матричного ряду: ")
eps = 1e-10; % Задаємо точність
B2 = E; % Нульовий крок
A1 = A;
while norm(A1,2)>=2*eps
    B2 = B2 + A1;
    A1 = A1*A;
end
disp(B2)
%Порівняємо результати


% Пункт 2. Перевірка виконання необхідної і достатньої умови
% продуктивності матриці A

disp(" Пункт 2. Перевірка виконання необхідної і достатньої умовипродуктивності матриці A:")
%Перевіримо умову додатності матриці (Е-А)^-1
p1 = all(all(B1>=0)); % Результат перевірки умові
if p1==1
    disp(" Матриця А - задовольняє умову додатності матриці (Е-А)^-1 ")
else
    disp(" Матриця А - не задовольняє умову додатності матриці (Е-А)^-1")
end

% Перевіряємо умову збіжності ряду та що сума матричного ряду дорівнює B(
% наближенно дорівнює B з певною наперед заданою точністю)

p2 = norm(A,2) < 1 ; % Нагадаємо що необхідною і достатньою умовою збіжності 
%геометричної прогрессії з матриць є умова що норма <1
p2 = p2 & all(all(B1-B2<=eps));

if p2==1
    disp(" Матриця А - задовольняє умову збіжності ряду до (Е-А)^-1 ")
else
    disp(" Матриця А - не задовольняє умову збіжності ряду до (Е-А)^-1 ")
end

% Шукаємо власні числа матриці А і перевіримо умову
% максимум( модулів всіх власних чисел) < 1 
L = eig(A);
if max(abs(L))<1

    p3 = 1;
    disp(" Матриця А -  задовольняє умову на власні числа")
else 
    p3 = 0;
    disp(" Матриця А -  не задовольняє умову на власні числа")
end

% Перевіряємо додатню визначенність матриці Е-А,
% За критерієм Сильвестра, достатньо перевірити додатність гол. мінорів
p4 = 1;
for i = 1:n
    p4 = p4 & det(A(1:i,1:i))>0;
    if ~p4
        break;
    end
end

if p4==1
    disp(" Матриця А - задовольняє умову про додатню визначеність (Е-А) ")
else
    disp(" Матриця А - не задовольняє умову про додатню визначеність (Е-А) ")
end


% Перевіримо виконання ВСІХ необхідних і достатніх умов
p = p1 & p2 & p3 & p4;
disp(" Після перевірки виконання ВСІХ необхідних і достатніх умов, маємо:")
if p == 1
    disp(" Матриця А - продуктивна")
else
    disp(" Матриця А - не є продуктивною")
end

% Пункт 3. Шукаємо вектор валового випуску Х
disp("Пункт 3.Шукаємо вектор валового випуску Х:")
%(a)
disp(" Результат, використовуючи знайдену матрицю B:")
Xa = B1 * Y;
X = Xa'
disp(Xa')
%(b)
disp(" Знаходження розв'язку СЛАР (E-A)*X=Y")
% Var(5,4) = 1
disp('Точний метод розв''язання СЛАР : Операція лівого ділення')
XbI1 =(E-A)\Y;
disp("XbI1")
disp(XbI1')
%Var (5,5) = 5;
disp(" Ітераційний метод розв'язання СЛАР : Метод найшвидшого спуску")

U = eye(n)-A;		AA = U'*U;  YY = U'*Y;
Xb= zeros(n,1);
Ok = false;
for k = 1:5000
	X0 = Xb;
	r = AA*Xb-YY;
	tau = dot(r,r)/dot(AA*r,r);
	Xb = Xb-tau*r;
	if norm(Xb-X0)<eps
		Ok = true;
		break
	end
end
if Ok
	disp('XbII5 :')
	disp(Xb')
	disp(['Ітерацій : ',num2str(k)])
else
	disp('Процес розбіжний!!!')
end
% 4. Обчислення x - матриці міжгалузевих поставок продукції
x = A;
for i = 1:n
    for j = 1:n
        x(i,j) = x(i,j).*Xa(j);
    end
end
disp("Матриця міжгалузевих поставок продукції")
disp(x)
% 5. Інтерактивне введення з клавіатури вектора Z
while 1
    Z = input('? Z = ');
    if all(Z>=0)
        break;
    else
        disp('Є від''ємні елементи !');
    end
end
% Для прикладу, візьмемо конкретне Z
% 6. Побудова таблиці-схеми статичного міжгалузевого балансу
MGB = [x, Y, Xa; Z, 0, 0; X, 0, sum(Xa)==sum(X)];
format SHORT G
disp('Схема статичного міжгалузевого балансу:');
disp(MGB)
