%% Тема 3, Задача 3
clear, close, clc
%	Вибір варіанта: ---------------------------------------------------------
g = 4; % Згідно списку
k = 5; % Kachaikin is fifth in list of gr
d = 173; % Birthday - 22 June, 173 day of Year
% ---------------------------------------------------------------------------
f = @ (x) (x.^2 - g)./(x.^3 + 0.2.*k + 0.1.*d); % Функція яку будемо інтерполювати
% 1) Дискретне представлення на сітці n = 10; X = linspace(-1,9,n+1);
n = 10;
X = linspace(-1,9,n+1);
Y = f(X);
% plot(X,Y), Для наближеної візуалізації

% --------------------------------------------------------------------
xx = linspace(-1,9,10*n+1);			% Ущільнений масив значень аргумента
% 2.a) Інтерполяційний поліном P_n:
Pn = polyfit(X,Y,n);
%disp(Pn);

% 2.b) Інтерполяційний сплайн S_0,1
S01 = interp1(X,Y,xx,'nearest');
%disp(S01);


% 2.c) Інтерполяційний сплайн S_1,1
S11 = interp1(X,Y,xx,'linear');

% Теорія: За апроксимації методом 'spline' у вузлових точках – неперервні перша і друга
%похідні, а у внутрішніх вузлах, сусідніх із кінцевими, – неперервна також і третя
%похідна => Побудована функція методом spline задовольняє крайові умови 4
%порядку

% 2.d) Інтерполяційний сплайн S_3,1
S31 = interp1(X,Y,xx,'spline');

% Побудова графіків
y1 = polyval(Pn,xx); % Значення інтерполяційного полінома на ущільненій множині значень
plot(X,Y,'ro',... % Візуалізація вузлів
xx,y1,... % Інтерполяційний поліном
xx,S01,...% Інтерполяційний сплайн S_0,1
xx,S11,...% Інтерполяційний сплайн S_1,1
xx,S31); % Інтерполяційний сплайн S_3,1
%legend("Interpolation nodes")
legend({'"Interpolation nodes"','Inter. Polynom', " Spline 0,1", "Spline 1,1", "Spline 3,1"},'Location','southeast')
legend('boxoff')