%% Тема 9, TASK3 ДОМАШНЄ ЗАВДАННЯ КАЧАЙКІН МАРКО 
clear, close, clc
C = [1,2,4,3;...
    6,3,8,5;...
    4,7,6,2;...
    0,0,0,0]; 

a = [60; 80; 100; 20];
b = [40; 60; 90; 70];			
%---------- Перехід до параметрів задачі лін. програмування
[m,n] = size(C);
f = reshape(C',[1 m*n]);			
one_ = ones(1,n);						% допоміжний вектор-рядок з одиніць довжини n
for i = 1:m
	k = ((i-1)*n+1):i*n;
	Aeq(i,k) = one_;					% коефіцієнти рівнянь вивезення від 
											% постачальників
end
one_ = ones(1,m);						% допоміжний вектор-рядок з одиніць довжини m
for j = 1:n
	k = j:n:((m-1)*n+j);
	Aeq(m+j,k) = one_;				% коефіцієнти рівнянь потреб від 
											% споживачів
end
Beq = [a;b];							% праві частини рівнянь-обмежень
low = zeros(m*n,1);						% вектор-стовпчик мінімальних значень
up = [];									% обмеження зверху відсутні

[z,fval,flag,output] = linprog(f,[],[],Aeq,Beq,low,up);
X = reshape(z,n,m)';			% Перетворення вектор-розв'язку на матрицю 
									% оптимального плану
disp('Оптимальний план перевезень :')
disp(X)
disp('Значення мінімальних затрат на перевезення :')
disp(fval)