%% Тема 9, TASK1 ДОМАШНЄ ЗАВДАННЯ КАЧАЙКІН МАРКО 
clear, close, clc
C = [2,3,4,20; 1,2,5,40; 10,20,30,60];	
x = zeros(3,4);
if C(1,4)+C(2,4) == C(3,4) %Умова збалансованності
     for i=1:3
        for j=1:4
            %Метод північно-західного кута
            a=min(C(i,4),C(3,j));
            x(i,j)=a;
            C(i,4)=C(i,4)-a;
            C(3,j)=C(3,j)-a;
        end
     end
else
    disp('Перевірте умову збалансованності')

end
disp('Допустимий базисний план'); disp(x(1:2,1:3));

disp('Сумарна собівартість'); disp(sum(sum(x(1:2,1:3).*C(1:2,1:3))))