%% Тема 5, TASK1 ДОМАШНЄ ЗАВДАННЯ КАЧАЙКІН МАРКО 
clear, close, clc
%	Вибір варіанта: ---------------------------------------------------------
g = 4; % Згідно списку
k = 5; % Kachaikin is fifth in list of gr
d = 173; % Birthday - 22 June, 173 day of Year
% ---------------------------------------------------------------------------
u   = @(x)sin(x);
du  = @(x)cos(x);


n = 30;

X1 = linspace(0,3,n+1);% Сітка
h1 = X1(2)-X1(1); % Крок сітки

X2 = linspace(0,3,2*n+2); % Ущільнена сітка
h2 = X2(2)-X2(1); % Крок ущільненої сітки h2 = h1/2


U_1 = u(X1); dU_1 = du(X1); % Табуляція функції на сітці


U_2 = u(X2); dU_2 = du(X2); % Табулція функції на ущільненій сітці


% (a)
% Уточнена апроксимація за допомогою центральної різниці

U_C = zeros(1,n+1);

for i = 2:n
    U_C(i) = (U_1(i+1)-U_1(i-1))/(2*h1);
end

U_C_2 = zeros(1,2*n+2); % На ущільненій сітці
for i =2:2*n+1
    U_C_2(i) = (U_2(i+1)-U_2(i-1))/(2*h2);
end
%{
Для перегляду графіку треба розкоментувати:
%plot(X1,U_C,'b--',X1,dU_1,'r')
disp(norm(U_C-dU_1,inf))
%}


% Уточнена апроксимація формулою Рунге-Ромберга

U_R = zeros(1,n+1);

for i = 1:n
    U_h1 = (U_1(i+1)-U_1(i))/h1;
    U_h2 = (U_2(2*i+1)-U_2(2*i))/h2;
    U_R(i) = 2*U_h2 - U_h1;

end

%{
Для перегляду графіку треба розкоментувати:
plot(X1,U_R,'b--',X1,dU_1,'r')
disp(norm(U_R-dU_1,inf))
%}

% (b)
subplot(1,2,1)
plot(X1,dU_1-U_C,'r--',X1,dU_1-U_R,'b.')
subplot(1,2,2)
plot(X2,dU_2-U_C_2,'r--',X1,dU_1-U_R,'b.')

