%% Тема 5, TASK1 ДОМАШНЄ ЗАВДАННЯ КАЧАЙКІН МАРКО 
clear, close, clc
%	Вибір варіанта: ---------------------------------------------------------
g = 4; % Згідно списку
k = 5; % Kachaikin is fifth in list of gr
d = 173; % Birthday - 22 June, 173 day of Year
% ---------------------------------------------------------------------------
% ЗАДАНО ФУНКЦІЮ f(x):

f = @ (x) (x.^2 - g)/(x.^3 + 0.2*k+0.1*d);
df = @(x) (x*(-x.^3+12*x+36.6))/((x.^3 + 18.3).^2);
ddf = @(x) (2*(x.^6 - 24*x.^4 - 128.1 * x.^3 + 219.6*x+334.89))/((x.^3 + 18.3).^3);
% Сітка+Табуляція на сітці:
n = 20;
X = linspace(-1,9,n+1);
h = X(2) - X(1);
F = zeros(1,n+1);
dF = F ;% Масив майбутніх значень теор першої похідної
ddF = F; % Масив майбутніх значень теор другої похідної
F_L = F; F_R = F; F_C = F; F_D = F; % Масиви для майбутніх значень похідних
for i=1:n+1
    F(i) = f(X(i));
    dF(i) = df(X(i));
    ddF(i) = ddf(X(i));
end


% Знайти Різницеву ліву похідну
for i = 2:n+1
    F_L(i) = ( F(i) - F(i-1))/h;
end

%{
Для перегляду графіку треба розкоментувати:
subplot(1,2,1)
plot(X,F_L,'r-',X,dF,'b--') % Наближене і теоритичне значення похідної
subplot(1,2,2)
plot(X,dF-F_L) % Графік похибки
disp(norm(dF-F_L,inf)) % Похибка
%}


% Різницеву праву похідну;

for i = 1:n
    F_R(i) = (F(i+1)-F(i))/h;
end

%{
Для перегляду графіку треба розкоментувати:
subplot(1,2,1)
plot(X,F_R,'r-',X,dF,'b--') % Наближене і теоритичне значення похідної
subplot(1,2,2) 
plot(X,dF-F_R) 
disp(norm(dF-F_L,inf))
%}


% Центральну різницеву похідну;
for i = 2:n
    F_C(i) = (F(i+1)-F(i-1))/(2*h);
end

%{
Для перегляду графіку треба розкоментувати:

subplot(1,2,1)
plot(X,F_C,'r-',X,dF,'b--') % Наближене і теоритичне значення похідної
subplot(1,2,2)
plot(X,dF-F_C) % Графік похибки
disp(norm(dF-F_C,inf)) % Похибка
%}


% Другу різницеву похідну;
for i = 2:n
    F_D(i) = (F(i+1)+F(i-1) - 2*F(i))/(h.^2);
end

%{
Для перегляду графіку треба розкоментувати:
subplot(1,2,1)
plot(X,F_D,'r-',X,ddF,'b--') % Наближене і теоритичне значення похідної
subplot(1,2,2)
plot(X,ddF-F_D) % Графік похибки
disp(norm(ddF-F_D,inf)) % Похибка
%}

% Першу похідну від інтерполяційного полінома, який наближає f;

P = polyfit(X,F,n);
dP = polyder(P);
dY = polyval(dP,X);

%{
Для перегляду графіку треба розкоментувати:
subplot(1,2,1)
plot(X,dF,'r-',X,dY,'b--') % Наближення інт поліномом і теоритичне значення похідної
subplot(1,2,2)
plot(X,dF-dY) % Графік похибки
disp(norm(dF-dY,inf)) % Похибка
%}


% Другу похідну від інтерполяційного полінома, який наближає f.

ddP = polyder(dP);
ddY = polyval(ddP,X);

subplot(1,2,1)
plot(X,ddF,'r-',X,ddY,'b--') % Наближення інт поліномом і теоритичне значення похідної
subplot(1,2,2)
plot(X,ddF-ddY) % Графік похибки
disp(norm(ddF-ddY,inf)) % Похибка


