%% Тема 8, TASK2 ДОМАШНЄ ЗАВДАННЯ КАЧАЙКІН МАРКО 
clear, close, clc
%	Вибір варіанта: ---------------------------------------------------------
g = 4; % Згідно списку
k = 5; % Kachaikin is fifth in list of gr
d = 173; % Birthday - 22 June, 173 day of Year
% mod(g+d = 177,2) = 1, тому будемо шукати максимум 
% ---------------------------------------------------------------------------
% Розв'язати задачу ЛП 
%            20x+35y -> max
%            3x+2y>=0;
%            2x-3y<=-1; 
%            3x-4y<=8; 
%            0<=x<=8; 
%            0<=y<=9;

%2)Використання вбудованої функції linprog.

f = [-20, -35];		% коефіцієнти цільової функції
A = [-3, -2; ...
	 2, -3; ...
	  3, -4; ...
      1, 0;...
      0, 1];					% матриця умов типу "<="
b = [0; -1; 8;8;9];		% вектор правих частин умов типу "<="
Aeq = [];					% умов типу "=" немає
beq = [];
lb = [0; 0];				% вектор мінімальних значень оптимізаційних параметрів
ub = [];						% вектор максимальних значень оптимізаційних параметрів
								% (обмеження відсутні)
[mP,mVal,exitflag,output] = linprog(f,A,b,Aeq,beq,lb,ub);
disp(['Макс. значення цільової функції = ',num2str(-mVal)]) 
disp('Оптимальний сценарій:')
disp(mP')