%% Тема 8, TASK1 ДОМАШНЄ ЗАВДАННЯ КАЧАЙКІН МАРКО 
clear, close, clc
%	Вибір варіанта: ---------------------------------------------------------
g = 4; % Згідно списку
k = 5; % Kachaikin is fifth in list of gr
d = 173; % Birthday - 22 June, 173 day of Year
% mod(g+d = 177,2) = 1, тому будемо шукати максимум 
% ---------------------------------------------------------------------------
% Розв'язати задачу ЛП 
%            20x+35y -> max
%            3x+2y>=0;
%            2x-3y<=-1; 
%            3x-4y<=8; 
%            0<=x<=8; 
%            0<=y<=9;

% 1) Графічним методом

% Графічне зображення множини допустимих значень сценаріїв
%		Багатокутник з умов типу нерівності
X = [0 8];
Y1 = (-3/2)*X;			% пряма 3x+2y = 0 
Y2 = (1/3) + (2/3)*X;   % пряма 2x-3y=-1
Y3 = -2+(3/4)*X;           % пряма 3x-4y=8

plot(X,Y1,'k-',X,Y2,'k-',X,Y3,'k-','LineWidth',1.5)
hold on
plot(X,[0 0],'k-',X,[9 9],'k-', [0 0],[0 9],'k-', [8 8], [0 9], 'k-')
axis([0 8 0 9])
hold on

%		Зафарбовуємо багатокутник з умов типу нерівності
Px = [0 0 8 8];				% x1-координати вершин
Py = [(1/3) 9 9 17/3];			% x2-координати вершин
fill(Px,Py,'y')
hold on

% Порівняння значень цільової функції на вершинах многокутника
F = @(x,y) 20*x + 35*y;

Values = zeros(1,4);
for i=1:4
    Values(i) = 20*Px(i) + 35*Py(i);
end
disp(Values)

% Виведення результату
for i=1:4
    if Values(i)==max(Values)
        plot(Px(i),Py(i),'r*')
        sprintf("Оптимальний сценарій = (%f,%f)",Px(i),Py(i))
        sprintf("Максимальне значення функції = %f ",Values(i))
    end
end
