%% Тема 7, TASK1 ДОМАШНЄ ЗАВДАННЯ КАЧАЙКІН МАРКО 
clear, close, clc

m = 0.4;
s = 0.6;
a=0.3; b=0.3; c=100; d=1;

p = @(x) (a + b/(c+d*x));
odef = @(x,t) s*m*x*p(x); % Права частина ЗДР
T0 = 0; T1 = 15;% Відрізок пошуку розв'язку Задачі Коші
x0 = 5;%Пу
% В умові не задано крок сітки, тому візьмемо таку саму як в аудиторній
N = 20;
h = (T1-T0)/N;								% крок сітки
t = T0:h:T1;

% Явний метод Ейлера:

Y1 = zeros(size(t)); % Вектор майбутнього розв'язку явним методом
Y1(1) = x0;% Початкове значення розв'язку

for n=1:(N)
    Y1(n+1) = Y1(n) + h*odef(t(n),Y1(n));
end

% Неявний метод Ейлера

Y2 = zeros(size(t)); % Вектор майбутнього розв'язку неявним методом
Y2(1) = x0;% Початкове значення розв'язку

for n=1:(N)
    F = @(z) z-Y2(n)-h*odef(t(n+1),z);
    Y2(n+1) = fzero(F,Y2(n));
end


plot(t,Y1,'r--',t,Y2,'b.')